code/Transbank/Webpay/logs/webpay-2017-06-22.txt

23:44:59 - datos request initTransaction 
Array
(
    [wSTransactionType] => TR_MALL_WS
    [commerceId] => 597020000542
    [buyOrder] => 000000010
    [sessionId] => 
    [returnURL] => http://kivulqa.xpectrumtech.com/webpay/payment/response
    [finalURL] => http://kivulqa.xpectrumtech.com/webpay/payment/success
    [transactionDetails] => Array
        (
            [commerceCode] => 597020000543
            [buyOrder] => 000000010
            [amount] => 50
        )

)

23:45:01 - initTransaction request  - <?xml version="1.0"?>
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/"><soap:Header><wsse:Security xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" soap:mustUnderstand="1"><ds:Signature xmlns:ds="http://www.w3.org/2000/09/xmldsig#" Id="SIG-680896"><ds:SignedInfo><ds:CanonicalizationMethod Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"><ec:InclusiveNamespaces xmlns:ec="http://www.w3.org/2001/10/xml-exc-c14n#" PrefixList="soap"/></ds:CanonicalizationMethod><ds:SignatureMethod Algorithm="http://www.w3.org/2000/09/xmldsig#rsa-sha1"/><ds:Reference URI="#id-680895"><ds:Transforms><ds:Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"><ec:InclusiveNamespaces xmlns:ec="http://www.w3.org/2001/10/xml-exc-c14n#" PrefixList=""/></ds:Transform></ds:Transforms><ds:DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1"/><ds:DigestValue>diVyllJ2tGu6yyES1hr+TgAMxcQ=</ds:DigestValue></ds:Reference></ds:SignedInfo><ds:SignatureValue>RlmSitVcdmPDyhQegHmljJNCtm0XakiUIIg88pT9kr1dZbSJRh2rPxZPPg0pLGmTXqLNAxi/giEN
bq30+cBDVdmUSPiOxwHtwCHEdm6dNKgjx1EBFNiEgd06d1oH4faCuiyrmOArWzNZIwPeLnqoLOer
6sLQw8LZElmpg/VWAiLprO/26+7ovyrvycf0FgyJmcwEyiYvJCq99yFcWlI2ktQVcGyUa2HLPF89
YOBemhk0s9BpSvfRSPHf8MzEn7j3XCJJpB0Zav3MLFcf0tCYgQ1s8XylsvWrkcId6WmAG6ySfKfj
ozfHrlssAzIGhj6oVP5WKQwJa47CX90gxkH+mg==</ds:SignatureValue><ds:KeyInfo Id="KI-530FDA96CA8136399814981751010221021538"><wsse:SecurityTokenReference wsu:Id="STR-530FDA96CA8136399814981751010221021539"><ds:X509Data><ds:X509IssuerSerial><ds:X509IssuerName>CN=10,OU=kdu,O=kdu,L=Santiago,ST=Chile,C=CL</ds:X509IssuerName><ds:X509SerialNumber>1449520866</ds:X509SerialNumber></ds:X509IssuerSerial></ds:X509Data></wsse:SecurityTokenReference></ds:KeyInfo></ds:Signature></wsse:Security></soap:Header><soap:Body xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" wsu:Id="id-680895"><ns2:initTransactionResponse xmlns:ns2="http://service.wswebpay.webpay.transbank.com/"><return><token>e9623eb16900defdf891fd7b0a6712b49d71c5a887b3c39a4124993f12966f33</token><url>https://webpay3gint.transbank.cl/filtroUnificado/initTransaction</url></return></ns2:initTransactionResponse></soap:Body></soap:Envelope>

23:45:01 - initTransaction response - <?xml version="1.0"?>
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/"><soap:Header><wsse:Security xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" soap:mustUnderstand="1"><ds:Signature xmlns:ds="http://www.w3.org/2000/09/xmldsig#" Id="SIG-680896"><ds:SignedInfo><ds:CanonicalizationMethod Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"><ec:InclusiveNamespaces xmlns:ec="http://www.w3.org/2001/10/xml-exc-c14n#" PrefixList="soap"/></ds:CanonicalizationMethod><ds:SignatureMethod Algorithm="http://www.w3.org/2000/09/xmldsig#rsa-sha1"/><ds:Reference URI="#id-680895"><ds:Transforms><ds:Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"><ec:InclusiveNamespaces xmlns:ec="http://www.w3.org/2001/10/xml-exc-c14n#" PrefixList=""/></ds:Transform></ds:Transforms><ds:DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1"/><ds:DigestValue>diVyllJ2tGu6yyES1hr+TgAMxcQ=</ds:DigestValue></ds:Reference></ds:SignedInfo><ds:SignatureValue>RlmSitVcdmPDyhQegHmljJNCtm0XakiUIIg88pT9kr1dZbSJRh2rPxZPPg0pLGmTXqLNAxi/giEN
bq30+cBDVdmUSPiOxwHtwCHEdm6dNKgjx1EBFNiEgd06d1oH4faCuiyrmOArWzNZIwPeLnqoLOer
6sLQw8LZElmpg/VWAiLprO/26+7ovyrvycf0FgyJmcwEyiYvJCq99yFcWlI2ktQVcGyUa2HLPF89
YOBemhk0s9BpSvfRSPHf8MzEn7j3XCJJpB0Zav3MLFcf0tCYgQ1s8XylsvWrkcId6WmAG6ySfKfj
ozfHrlssAzIGhj6oVP5WKQwJa47CX90gxkH+mg==</ds:SignatureValue><ds:KeyInfo Id="KI-530FDA96CA8136399814981751010221021538"><wsse:SecurityTokenReference wsu:Id="STR-530FDA96CA8136399814981751010221021539"><ds:X509Data><ds:X509IssuerSerial><ds:X509IssuerName>CN=10,OU=kdu,O=kdu,L=Santiago,ST=Chile,C=CL</ds:X509IssuerName><ds:X509SerialNumber>1449520866</ds:X509SerialNumber></ds:X509IssuerSerial></ds:X509Data></wsse:SecurityTokenReference></ds:KeyInfo></ds:Signature></wsse:Security></soap:Header><soap:Body xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" wsu:Id="id-680895"><ns2:initTransactionResponse xmlns:ns2="http://service.wswebpay.webpay.transbank.com/"><return><token>e9623eb16900defdf891fd7b0a6712b49d71c5a887b3c39a4124993f12966f33</token><url>https://webpay3gint.transbank.cl/filtroUnificado/initTransaction</url></return></ns2:initTransactionResponse></soap:Body></soap:Envelope>

23:45:48 - transactionResult request  - <?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ns1="http://service.wswebpay.webpay.transbank.com/"><SOAP-ENV:Body><ns1:getTransactionResult><tokenInput>e9623eb16900defdf891fd7b0a6712b49d71c5a887b3c39a4124993f12966f33</tokenInput></ns1:getTransactionResult></SOAP-ENV:Body></SOAP-ENV:Envelope>

23:45:48 - transactionResult response - <?xml version="1.0"?>
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/"><soap:Header><wsse:Security xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" soap:mustUnderstand="1"><ds:Signature xmlns:ds="http://www.w3.org/2000/09/xmldsig#" Id="SIG-739592"><ds:SignedInfo><ds:CanonicalizationMethod Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"><ec:InclusiveNamespaces xmlns:ec="http://www.w3.org/2001/10/xml-exc-c14n#" PrefixList="soap"/></ds:CanonicalizationMethod><ds:SignatureMethod Algorithm="http://www.w3.org/2000/09/xmldsig#rsa-sha1"/><ds:Reference URI="#id-739591"><ds:Transforms><ds:Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"><ec:InclusiveNamespaces xmlns:ec="http://www.w3.org/2001/10/xml-exc-c14n#" PrefixList=""/></ds:Transform></ds:Transforms><ds:DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1"/><ds:DigestValue>KqDSbGGDFaJG5pNGjJ3WZlFUa7k=</ds:DigestValue></ds:Reference></ds:SignedInfo><ds:SignatureValue>YU4Dz3SvqWDfqbZ3JbGgJh75ucXtMj3BOtSqhYGHPqQqnSIcdW3XgktQUqYf89yvcA7bPhiDcDrW
4GoC+XLnsdWv5Z+uCtuvt1SRfvY7lfjBRWUzoaBpOZbXwZMlnt4dPvny4vx36zWeRjMtc+y5dHDo
tpCTVHDBs071OtX6TkWGEEA+oCUhAS33nxUwaLKOUDNQhAE05ubc25APBKJt5++1jI6jXHwLHJVl
CjxerHK8kzRNIJDeyj0GE6Ic04NObr9u+zXfluVPWORK16I63uXI+JK0++cWLrUtLHR9xIurkdu/
4vsF46Cjrs6XQ2Lzs+y+j661H4DDNxnypt6Ayw==</ds:SignatureValue><ds:KeyInfo Id="KI-9232D575EC2526723214981751496411109402"><wsse:SecurityTokenReference wsu:Id="STR-9232D575EC2526723214981751496411109403"><ds:X509Data><ds:X509IssuerSerial><ds:X509IssuerName>CN=10,OU=kdu,O=kdu,L=Santiago,ST=Chile,C=CL</ds:X509IssuerName><ds:X509SerialNumber>1449520866</ds:X509SerialNumber></ds:X509IssuerSerial></ds:X509Data></wsse:SecurityTokenReference></ds:KeyInfo></ds:Signature></wsse:Security></soap:Header><soap:Body xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" wsu:Id="id-739591"><ns2:getTransactionResultResponse xmlns:ns2="http://service.wswebpay.webpay.transbank.com/"><return><accountingDate>0622</accountingDate><buyOrder>000000010</buyOrder><cardDetail><cardNumber>6623</cardNumber></cardDetail><detailOutput><sharesNumber>0</sharesNumber><amount>50</amount><commerceCode>597020000543</commerceCode><buyOrder>000000010</buyOrder><authorizationCode>1213</authorizationCode><paymentTypeCode>VN</paymentTypeCode><responseCode>0</responseCode></detailOutput><transactionDate>2017-06-22T19:44:55.839-04:00</transactionDate><urlRedirection>https://webpay3gint.transbank.cl/filtroUnificado/voucher.cgi</urlRedirection><VCI>TSY</VCI></return></ns2:getTransactionResultResponse></soap:Body></soap:Envelope>

23:45:51 - acknowledgeTransaction request  - <?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ns1="http://service.wswebpay.webpay.transbank.com/"><SOAP-ENV:Body><ns1:acknowledgeTransaction><tokenInput>e9623eb16900defdf891fd7b0a6712b49d71c5a887b3c39a4124993f12966f33</tokenInput></ns1:acknowledgeTransaction></SOAP-ENV:Body></SOAP-ENV:Envelope>

23:45:51 - acknowledgeTransaction response - <?xml version="1.0"?>
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/"><soap:Header><wsse:Security xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" soap:mustUnderstand="1"><ds:Signature xmlns:ds="http://www.w3.org/2000/09/xmldsig#" Id="SIG-739594"><ds:SignedInfo><ds:CanonicalizationMethod Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"><ec:InclusiveNamespaces xmlns:ec="http://www.w3.org/2001/10/xml-exc-c14n#" PrefixList="soap"/></ds:CanonicalizationMethod><ds:SignatureMethod Algorithm="http://www.w3.org/2000/09/xmldsig#rsa-sha1"/><ds:Reference URI="#id-739593"><ds:Transforms><ds:Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"><ec:InclusiveNamespaces xmlns:ec="http://www.w3.org/2001/10/xml-exc-c14n#" PrefixList=""/></ds:Transform></ds:Transforms><ds:DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1"/><ds:DigestValue>IdBdW38BRZuzt1b1jEeCAZVv8BM=</ds:DigestValue></ds:Reference></ds:SignedInfo><ds:SignatureValue>LWneJ0ywQrm9B1Y1qCQ7HjLnLfRHogJyKQjCv9r3dwI+TxY0z6EEFRW2GCFcmabbyZo+ZZU4JGfX
tl5QHsQqwIZCpVb1UXhk8BCnlKqHmFJuH8Qd+QacNmjcRCKuoaFRvE9V0g0bXG9WCwwaMl//bCvY
pg4k2jk8nZioEX0sxOHXivG2Rxf+KfIoKc2Ad4qT73GsPieI548eK+rhBPYrcXQgIeMc9ldkpsbg
CcSxQlJMwaBJgPU1AjaQiceGJqR6ScuPwZLh+1HGrbxMMUqy8+34xhGICOJCbjHCXcM9NcinydNV
YODIjK36LHJIcPhJcSBUhMYkMxJZVByrJnp9Bw==</ds:SignatureValue><ds:KeyInfo Id="KI-9232D575EC2526723214981751521001109405"><wsse:SecurityTokenReference wsu:Id="STR-9232D575EC2526723214981751521001109406"><ds:X509Data><ds:X509IssuerSerial><ds:X509IssuerName>CN=10,OU=kdu,O=kdu,L=Santiago,ST=Chile,C=CL</ds:X509IssuerName><ds:X509SerialNumber>1449520866</ds:X509SerialNumber></ds:X509IssuerSerial></ds:X509Data></wsse:SecurityTokenReference></ds:KeyInfo></ds:Signature></wsse:Security></soap:Header><soap:Body xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" wsu:Id="id-739593"><ns2:acknowledgeTransactionResponse xmlns:ns2="http://service.wswebpay.webpay.transbank.com/"/></soap:Body></soap:Envelope>

